[
  {
    "text" : "Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке.",
    "author" :"Алан Пэрлис"
  },
  {
    "text" : "Программирование на С похоже на быстрые танцы на только что отполированном полу людей с острыми бритвами в руках.",
    "author" :"Валди Рэвенс"
  },
  {
    "text" : "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
    "author" :"Законы Мошэра"
  },{
    "text" : "В теории, теория и практика неразделимы. На практике это не так.",
    "author" :"Йоги Берра"
  },
  {
    "text" : "Я изобрел понятие «объектно-ориентированный», и могу заявить, что не имел в виду C++.",
    "author" :"Алан Кэй"
  },
  {
    "text" : "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
    "author" :"Христофер Томсон"
  },
  {
    "text" : "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
    "author" :"Билл Гейтс"
  },
  {
    "text" : "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
    "author" :"Лэрри Уолл"
  },
  {
    "text" : "Большинство программ на сегодняшний день подобны египетским пирамидам из миллиона кирпичиков друг на друге и без конструктивной целостности — они просто построены грубой силой и тысячами рабов.",
    "author" :"Алан Кэй"
  },
  {
    "text" : "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
    "author" :"Линус Торвальдс"
  },
  {
    "text" : "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь.",
    "author" :"Васэем Латиф"
  },
  {
    "text" : "Иногда лучшие программы создаются на бумажке. Запрограммировать их — второстепенная вещь.",
    "author" :"Макс Кэнет-Александэр"
  },
  {
    "text" : "Программирование — это разбиение чего-то большого и невозможного на что-то маленькое и вполне реальное.",
    "author" :"Язвонт"
  },
  {
    "text" : "Программисты — не математики, как бы нам этого ни хотелось.",
    "author" :"Ричард Гэбриэль"
  },
  {
    "text" : "Простота — залог надежности.",
    "author" :"Эдсгер Дийкстра"
  },
  {
    "text" : "Если вы хотите, чтобы код было легко и быстро писать — делайте его удобным для чтения.",
    "author" :"Роберт Мэртин"
  },
  {
    "text" : "Есть всего два типа языков программирования: те, на которые люди всё время ругаются, и те, которые никто не использует.",
    "author" :"Бйорн Строустрап"
  },
  {
    "text" : "Неработающая программа обычно приносит меньше вреда, чем работающая плохо.",
    "author" :"Дэйв Томас"
  },
  {
    "text" : "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать.",
    "author" :"Александер Голов"
  },
  {
    "text" : "Для каждой сложной задачи существует решение, которое является быстрым, простым и неправильным.",
    "author" :"Гарри Мэнкен"
  },
  {
    "text" : "Аналогично тому, как написание картины является искусством для души, так и написание программы является искусством для разума.",
    "author" :"Сергей Волник"
  },
  {
    "text" : "Тестирование не позволяет обнаружить такие ошибки, как создание не того приложения.",
    "author" :"Стив МакКонел"
  },
  {
    "text" : "Я не умею делать скриншоты, потому что я обычно работаю на компьютере в текстовом режиме.",
    "author" :"Ричард Стеллман"
  },
  {
    "text" : "Ходить по воде и разрабатывать программы, следуя спецификации, очень просто… если они заморожены.",
    "author" :"Эдвард Беррард"
  },
  {
    "text" : "Сначала учите науку программирования и всю теорию. Далее выработайте свой программистский стиль. Затем забудьте всё и просто программируйте.",
    "author" :"Джорж Каррете"
  },
  {
    "text" : "Трудность работы с программистом заключается в том, что вы не можете понять, что он делает, до тех пор, пока не стало слишком поздно.",
    "author" :"Сеймур Крей"
  }
]